cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "moncho/dry"
tap "remind101/formulae"  # Assume-role

brew "git"
brew "assume-role"
brew "dry"  # CLI docker manager
brew "entr"  # Run command when file changes
brew "fd"  # Better 'find' https://github.com/sharkdp/fd
brew "fzf"
brew "python3"
brew "gradle"
brew "grc"  # Log prettifier
brew "htop"
brew "hub"
brew "imagemagick"
brew "jid"
brew "jq"
brew "node"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "the_silver_searcher"
brew "tig"  # git on steroids
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "z"
brew "zsh-syntax-highlighting"

cask "alfred"
cask "authy"
cask "apptivate"
cask "docker"
cask "gimp"
cask "iterm2"
cask "karabiner-elements"
cask "lastpass"
cask "meld"
cask "mounty"
cask "notion"
cask "postman"
cask "shiftit"
cask "skype"
cask "slack"
cask "sensiblesidebuttons"
cask "spotify"
cask "the-unarchiver"
cask "viscosity"
cask "vlc"
cask "vscodium"
cask "zoom"

cask "font-fira-code-nerd-font"
